# Terraform Plan

## AI Summary of Changes
### Summary of Infrastructure Changes

#### Resources Being Created, Modified, or Destroyed
- **One S3 Bucket to be Replaced**:
  - The existing S3 bucket named `randon-bucket-name-213hiuas` will be replaced with a new one named `randon-bucket-name`.

#### Key Configuration Changes
- **Bucket Name Change**: The bucket name is changing from `randon-bucket-name-213hiuas` to `randon-bucket-name`.
- **ARN, Domain Names, and Region**: The ARN, bucket domain name, and regional domain name will be updated to reflect the new bucket name.
- **Tags Removal**: All existing tags on the bucket will be removed.
- **Grants, Encryption, and Versioning**: The existing grants, server-side encryption configuration, and versioning settings will be removed.

#### Potential Impact on the Infrastructure
- **Downtime**: Replacing the S3 bucket will cause a brief period of downtime as the bucket is recreated.
- **Data Migration**: Any data currently stored in the old bucket will need to be migrated to the new bucket.
- **Access Changes**: Any applications or services relying on the old bucket name or specific configurations will need to be updated.

#### Security or Cost Implications
- **Security**: Removing tags and configurations might affect access control and auditing. Ensure that the new bucket has appropriate security settings.
- **Cost**: There should be no significant cost changes unless the new bucket is created in a different region or with different storage classes.

### Approval Considerations
- Verify that the new bucket name and configurations meet your requirements.
- Ensure that any data migration is handled properly to avoid data loss.
- Confirm that updated access controls and security settings are in place post-migration.

<details><summary>Show Full Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.demo.aws_s3_bucket.example must be replaced
-/+ resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::randon-bucket-name-213hiuas" -> (known after apply)
      ~ bucket                      = "randon-bucket-name-213hiuas" -> "randon-bucket-name" # forces replacement
      ~ bucket_domain_name          = "randon-bucket-name-213hiuas.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_region               = "us-east-1" -> (known after apply)
      ~ bucket_regional_domain_name = "randon-bucket-name-213hiuas.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "randon-bucket-name-213hiuas" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "54fffc4f80142365ff0ae8ef12a8301955b37c38c67c4a07624d165dd56ac9c5" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

*Pusher: @biagolini, Action: `pull_request`*